app/views/excercises/_index.html.haml


        - block.excercises.map do |excercise|
---
SELECT "excercises".* FROM "excercises" WHERE "excercises"."block_id" = $1  [["block_id", 1]]

        %th Weight metric
        - if block.excercises.any? { |e| e.weight_metric == "% of movement" }
---
SELECT COUNT(*) FROM "excercises" WHERE "excercises"."block_id" = $1  [["block_id", 1]]