app/views/blocks/_form.html.haml

        -# sets count
        %th= "sets: #{block.excercises.count}"
        -# %th= f.number_field :sets, value: block.excercises.count
---
SELECT COUNT(*) FROM "excercises" WHERE "excercises"."block_id" = $1  [["block_id", 1]]