app/views/blocks/_index.html.haml

            %th= block_form.text_field :name, value: block.name
            %th= block_form.number_field :sets, value: block.excercises.count
---
SELECT COUNT(*) FROM "excercises" WHERE "excercises"."block_id" = $1  [["block_id", 1]]


              - if block.excercises.any?
                - block.excercises.map do |excercise|
---
SELECT  1 AS one FROM "excercises" WHERE "excercises"."block_id" = $1 LIMIT $2  [["block_id", 1], ["LIMIT", 1]]
SELECT "excercises".* FROM "excercises" WHERE "excercises"."block_id" = $1  [["block_id", 1]]