app/controllers/blocks_controller.rb

SELECT  "workouts".* FROM "workouts" WHERE "workouts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "blocks" ("name", "workout_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "New Block"], ["workout_id", 1], ["created_at", "2020-08-22 07:43:02.119922"], ["updated_at", "2020-08-22 07:43:02.119922"]]
---
  def create
    @workout = Workout.find(params[:workout_id])
    @block = @workout.blocks.create(name: 'New Block', style: 'Fixed')

SELECT  "blocks".* FROM "blocks" WHERE "blocks"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "excercises".* FROM "excercises" WHERE "excercises"."id" = $1 LIMIT $2  [["id", 12], ["LIMIT", 1]]
UPDATE "excercises" SET "movement" = $1, "measurement_metric" = $2, "measurement_value" = $3, "weight_metric" = $4, "weight_value" = $5, "updated_at" = $6 WHERE "excercises"."id" = $7  [["movement", "Back Squat"], ["measurement_metric", "reps"], ["measurement_value", 2], ["weight_metric", "kg"], ["weight_value", 110], ["updated_at", "2020-08-22 08:11:10.596923"], ["id", 12]]
UPDATE "blocks" SET "name" = $1, "updated_at" = $2 WHERE "blocks"."id" = $3  [["name", "Explode: Box Jumps"], ["updated_at", "2020-08-22 04:27:41.389095"], ["id", 1]]
---
  def update
    @block = Block.find(params[:id])

    if excercise_params
      @excercise = Excercise.find(excercise_params[:id])
      @excercise.update(excercise_params)
    end

    if @block.update(block_params)

SELECT  "blocks".* FROM "blocks" WHERE "blocks"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
DELETE FROM "blocks" WHERE "blocks"."id" = $1  [["id", 2]]
---
  def destroy
    @block = Block.find(params[:id])
    @block.destroy