app/controllers/blocks_controller.rb

  def create
    @workout = Workout.find(params[:workout_id])
---
SELECT  "workouts".* FROM "workouts" WHERE "workouts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]