app/controllers/excercises_controller.rb

SELECT  "blocks".* FROM "blocks" WHERE "blocks"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "blocks".* FROM "blocks" WHERE "blocks"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
SELECT  "excercises".* FROM "excercises" WHERE "excercises"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
INSERT INTO "excercises" ("movement", "block_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["movement", "New Excercise"], ["block_id", 1], ["created_at", "2020-08-22 08:02:10.303758"], ["updated_at", "2020-08-22 08:02:10.303758"]]
---
  def create
    @block = Block.find(params[:block_id])

    # try keep all excercises with the same details in the one block
    template_excercise = @block.excercises.first
    if template_excercise
      @excercise = template_excercise.dup
    else
      @excercise = @block.excercises.new(movement: 'New Excercise')
    end

    if @excercise.save

SELECT  "excercises".* FROM "excercises" WHERE "excercises"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "excercises" SET "measurement_value" = $1, "updated_at" = $2 WHERE "excercises"."id" = $3  [["measurement_value", 8], ["updated_at", "2020-08-22 06:48:07.508098"], ["id", 4]]
---
  def update
    @excercise = Excercise.find(params[:id])

    if @excercise.update(excercise_params)

SELECT  "excercises".* FROM "excercises" WHERE "excercises"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
DELETE FROM "excercises" WHERE "excercises"."id" = $1  [["id", 2]]
---
  def destroy
    @excercise = Excercise.find(params[:id])
    @excercise.destroy