app/controllers/training_templates_controller.rb

SELECT "training_templates".* FROM "training_templates"
---
  def index
    @training_templates = TrainingTemplate.all

SELECT  "training_templates".* FROM "training_templates" WHERE "training_templates"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    @training_template = TrainingTemplate.find(params[:id])

SELECT  "training_templates".* FROM "training_templates" WHERE "training_templates"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def edit
    @training_template = TrainingTemplate.find(params[:id])

INSERT INTO "training_templates" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "another template"], ["created_at", "2020-08-16 12:35:57.706257"], ["updated_at", "2020-08-16 12:35:57.706257"]]
---
  def create
    @training_template = TrainingTemplate.new(training_template_params)

    if @training_template.save

SELECT  "training_templates".* FROM "training_templates" WHERE "training_templates"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "training_templates" SET "name" = $1, "updated_at" = $2 WHERE "training_templates"."id" = $3  [["name", "Plyo Basketball Temaplte"], ["updated_at", "2020-08-22 06:57:37.216496"], ["id", 1]]
---
  def update
    @training_template = TrainingTemplate.find(params[:id])

    if @training_template.update(training_template_params)

SELECT  "training_templates".* FROM "training_templates" WHERE "training_templates"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
DELETE FROM "training_templates" WHERE "training_templates"."id" = ?  [["id", 2]]
---
  def destroy
    @training_template = TrainingTemplate.find(params[:id])
    @training_template.destroy