app/controllers/training_templates_controller.rb

SELECT "training_templates".* FROM "training_templates" WHERE "training_templates"."user_id" = $1  [["user_id", 1]]
---
  def index
    @training_templates = TrainingTemplate.where(user_id: current_user.id)