app/controllers/workouts_controller.rb

  def show
    @workout = Workout.find(params[:id])
---
SELECT  "workouts".* FROM "workouts" WHERE "workouts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def edit
    @workout = Workout.find(params[:id])
---
SELECT  "workouts".* FROM "workouts" WHERE "workouts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def create
    @workout = Workout.new(workout_params)

    if @workout.save
---
INSERT INTO "workouts" ("name", "day_number", "training_template_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "AM Plyo"], ["day_number", 42], ["training_template_id", 1], ["created_at", "2020-08-19 13:10:19.881713"], ["updated_at", "2020-08-19 13:10:19.881713"]]

  def destroy
    @workout = Workout.find(params[:id])
    @workout.destroy
---
SELECT  "workouts".* FROM "workouts" WHERE "workouts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "workouts" WHERE "workouts"."id" = ?  [["id", 1]]